Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E06C.tmx
Source language: en_us
Languages: zh_cn

source: Lemon battery
zh_cn: 手把手教你做个柠檬电池！

source: Batteries consist of two different metals suspended in an acidic solution.
zh_cn: 在使用酸的电池制造方式中需要两种不同的金属。

source: Copper and Zinc work well as the metals and the citric acid content of a lemon will provide the acidic solution.
zh_cn: 铜和锌是非常好的选择，因为它们能和柠檬中的柠檬酸形成很好的酸性电池环境。

source: Batteries like this will not be able to run a motor or energize most light bulbs.
zh_cn: 像这样的电池还不能为发动机或者大部分的灯泡提供能量。

source: It is possible to produce a dim glow from an LED.
zh_cn: 但是已经足够让一个LED灯发出微弱的灯光。

source: The lemon: A large, fresh, "juicy" lemon works best.
zh_cn: 新鲜个大汁液充足的柠檬是我们的不二选择。

source: The nail: Galvanized nails are coated in zinc.
zh_cn: 钉子一般会用锌镀上一层外皮。

source: I used a 2" galvanized common nail.
zh_cn: 这里我选用一般的二号镀锌钉。

source: The penny: Any copper coin will work.
zh_cn: 任何一种铜硬币都可以发挥作用。

source: Creating the battery: Insert a penny into a cut on one side of the lemon. Push a galvanized nail into the other side of the lemon.
zh_cn: 来制作我们的电池：在柠檬的一侧切开一个小口，将硬币插进去，然后将镀锌的钉子插入到柠檬的另外一边。

source: The nail and penny must not touch.
zh_cn: 钉子和硬币绝对不能互相接触。

source: This is a single cell of a battery.
zh_cn: 如图所示是一个单芯的电池。

source: The zinc nail and the copper penny are called electrodes.
zh_cn: 镀锌钉和铜硬币就是电池的电极。

source: The lemon juice is called electrolyte.
zh_cn: 而柠檬中的柠檬汁就是电解质。

source: All batteries have a "+" and "-" terminal.
zh_cn: 所有的电池都应该有正负两端。

source: Electric current is a flow of atomic particles called electrons.
zh_cn: 电流是由叫做电子的微粒流动而形成的。

source: Certain materials , called conductors, allow electrons to flow through them.
zh_cn: 某些导体能让电子随意穿过他们。

source: Most metals (copper, iron) are good conductors of electricity.
zh_cn: 它们中的绝大部分都像铜和锌一样，是电流的良导体。

source: Electrons will flow from the "-" electrode of a battery, through a conductor, towards the "+" electrode of a battery.
zh_cn: 电子将有负电极流出，经过导体，流进电池的正极。

source: Volts (voltage) is a measure of the force moving the electrons.
zh_cn: 而电压则是一种对电子推力大小的测量。

source: I have connected a volt meter to our single cell lemon battery.
zh_cn: 我将一个电压计连到了我们的单芯柠檬电池上。

source: The meter tells us this lemon battery is creating a voltage of 0.906 volts.
zh_cn: 电压计显示柠檬电池可以提供0.906伏特的电压。

source: Unfortunately this battery will not produce enough current (flowing electrons) to light a bulb.
zh_cn: 不幸的是这个电压还不能产生足够的电流来点亮一个灯泡。

source: To solve this problem we can combine battery cells to create higher voltages.
zh_cn: 为了解决这个问题，我们可以将多个柠檬电池串联起来一次产生较高的电压。

source: Building more lemon batteries and connecting them with a metal wire from "+" to "-" adds the voltage from each cell.
zh_cn: 我们可以用前面的方法做更多的柠檬电池，并用金属线将他们之间的正负极连接起来来让电压加成。

source: The two lemon batteries above, combine to produce a voltage of 1.788 volts.
zh_cn: 如图所示，将两个柠檬电池串联起来我们可以产生1.788伏特的电压。

source: This combination still does not create enough current to light a small bulb.
zh_cn: 这样产生的电压还是不够支撑起一个小灯泡。

source: Note the red wire connecting the batteries is joined from "+" (penny) to "-" (galvanized nail).
zh_cn: 一定要注意图中的红线是用来由+（硬币）连接到-（钉子）。

source: Four lemon batteries create a voltage of 3.50 volts.
zh_cn: 4个柠檬电池一起可以产生3.50伏特的电压。

source: We should be able to light up a small device like an LED (Light Emitting Diode).
zh_cn: 我们可以用它来驱动一个小型的用电装置，像LED灯（Light Emitting Diode）。

source: Note the connecting wires go from "+" to "-" on each battery.
zh_cn: 注意，每个电池之间都是将正极和负极相连。

source: To turn on an LED you must determine the "+" and "-" connections.
zh_cn: 想要LED灯发光，你必须先判断LED的正极和负极。

source: If you look closely at the red plastic base of an LED you will notice a "flat" spot (indicated by arrow above).
zh_cn: 自己观察LED的红色塑料地盘，你会看到一个平点（如图中箭头所示）。

source: The wire that comes out beside the flat spot must connect to the "-" side of a battery, the other wire to the "+" side.
zh_cn: 由平点后面出来的线必须被连接到电池的负极。另外一根则连接到正极。

source: Important information about LED's: LED's are designed to work at very low voltages (~ 2V) and low currents.
zh_cn: 关于LED的重要信息：LED是被用来工作在非常小的电压（大约2伏）和电流环境下的。

source: They will be damaged if connected to batteries rated at over 2 volts.
zh_cn: 如果供电的电压超过2伏，LED有可能被烧毁。

source: LED's require resistors to control current when used with batteries rated at over 2 volts.
zh_cn: 当使用2伏以上的电池时，需要使用额外的电阻来帮助控制电流。

source: Lemon batteries produce low current. It is OK to connect an LED to a lemon battery.
zh_cn: 而柠檬电池只能产生较小的电流，完全可以将它直接连到LED的两端。

source: In the above image, electrons flow from the "-" (nail) end of our lemon battery through the LED (making it glow) then back to the "+" (penny) end of the battery.
zh_cn: 如上图所示，电子由钉子一端流出柠檬电池经过LED然后由硬币那一端流回电池。

source: This is an electronic circuit.
zh_cn: 这整个形成了一个电路。

source: The LED glows dimly with this configuration.
zh_cn: 在这种环境下LED能发出微弱的光。

source: Improving your battery.
zh_cn: 加强你的电池

source: The quality of the copper and zinc can be a problem for a battery like this.
zh_cn: 像这种样子的电池，铜和锌的质量至关重要。

source: Pennies in particular are rarely pure copper.
zh_cn: 一般来说，硬币很少使用纯铜制造的。

source: Try substituting a length of 14 gauge copper wire (common house wire) for the penny.
zh_cn: 可以尝试使用14号铜线（家里最常见的那种）来替换硬币。

source: Experiment with different lengths and configurations of electrodes.
zh_cn: 可以做实验使用不同长度的铜线来当电极。

source: Other sources of zinc and copper may be found in the plumbing supply department of a hardware store.
zh_cn: 在器材商店的水管部应该可以找到其他的铜锌来源。
